In [8]:
import numpy as np
import pandas as pd

- 4.1.1

In [9]:
#(1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.
s1 = pd.Series([100,90,80], index= ['국어','영어','과학'])
s2 = pd.Series([90,70,80], index= ['국어','영어','수학'])

#(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.
t1 = s1 + s2
t2 = s1 - s2
t3 = s1 * s2
t4 = s1 / s2

t1, t2, t3, t4

(과학      NaN
 국어    190.0
 수학      NaN
 영어    160.0
 dtype: float64,
 과학     NaN
 국어    10.0
 수학     NaN
 영어    20.0
 dtype: float64,
 과학       NaN
 국어    9000.0
 수학       NaN
 영어    6300.0
 dtype: float64,
 과학         NaN
 국어    1.111111
 수학         NaN
 영어    1.285714
 dtype: float64)

- 4.1.2

In [10]:
# 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

# (1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

# (2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [11]:
data1 = { 
        '학생1' : ['철수', 19, 3.2, 'B', '서초구'],
        '학생2' : ['영희', 22, 4.0, 'A', '강남구'],
        '학생3' : ['지희', 21, 3.3, 'O', '송파구'],
        '학생4' : ['미희', 20, 3.1, 'B', '강동구'],
        '학생5' : ['진희', 25, 3.9, 'O', '동작구'],
}
index = ['이름','나이','학점','혈액형', '주소']
df1 = pd.DataFrame(data1, index=index)
df1

     학생1  학생2  학생3  학생4  학생5
이름    철수   영희   지희   미희   진희
나이    19   22   21   20   25
학점   3.2  4.0  3.3  3.1  3.9
혈액형    B    A    O    B    O
주소   서초구  강남구  송파구  강동구  동작구

- 4.1.3

In [12]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [13]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [14]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [15]:
#(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다
df['평균'] = df.mean(axis=1).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [16]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
del df['평균']
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [17]:
df.영어.방자 = 80
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [18]:
df['평균'] = df.mean(axis=1)
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [19]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df[0:1]

    국어  영어  수학         평균
춘향  80  90  90  86.666667

In [29]:
df.head(3)

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000

In [28]:
df.tail(1)

    국어  영어  수학    평균
방자  30  80  70  60.0

In [20]:
# (6) 향단의 점수를 시리즈로 나타낸다.
df.loc['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [30]:
df.head(3).tail(1)

    국어  영어  수학    평균
향단  70  60  80  70.0

In [33]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

- 4.3.1

In [37]:
df = pd.DataFrame(np.arange(5,5)),columns=list('ABCD')

SyntaxError: cannot assign to function call (Temp/ipykernel_12092/3259947834.py, line 1)

In [21]:
# 1)모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
data1 = { 
        '학생1' : ['철수', 19, 3.2, 'B', '서초구'],
        '학생2' : ['영희', 22, 4.0, 'A', '강남구'],
        '학생3' : ['지희', 21, 3.3, 'O', '송파구'],
        '학생4' : ['미희', 20, 3.1, 'B', '강동구'],
        '학생5' : ['진희', 25, 3.9, 'O', '동작구'],
}
index = ['이름','나이','학점','혈액형', '주소']
df1 = pd.DataFrame(data1, index=index)
df1

     학생1  학생2  학생3  학생4  학생5
이름    철수   영희   지희   미희   진희
나이    19   22   21   20   25
학점   3.2  4.0  3.3  3.1  3.9
혈액형    B    A    O    B    O
주소   서초구  강남구  송파구  강동구  동작구

In [22]:
# 2) 10가지 이상의 방법으로 특정한 행과 열을 선택한다.